CSI API ETABS v1
cDStSP16_13330_2017.SetPreference Method
 Sets the value of a steel design preference item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDStSP16_13330_2017
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 16, inclusive, indicating the preference item considered
Multi-response case design
Framing type (Not used anymore)
Section class (Not used anymore)
GammaM
GammaC
GammeU
GammaC1
Consider deflection
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value (Not used anymore)
Total load deflection limit, L/Value
Total - Camber limit, L/Value
Pattern live load factor
Demand/capacity ratio limit
Reliability factor
Max Number of Auto Iterations
Value
Type: System.Double
 The value of the considered preference item
Multi-response case design
1 = Envelopes
2 = Step-by-step
3 = Last step
4 = Envelopes -- All
5 = Step-by-step -- All
Framing type (Not used anymore)
Section class (Not used anymore)
GammaM
Value > 0
GammaC
Value > 0
GammaU
Value > 0
GammaC1
Value > 0
Consider deflection
0 = No
Any other value = Yes
DL deflection limit, L/Value
Value > 0
SDL + LL deflection limit, L/Value
Value > 0
LL deflection limit, L/Value (Not used anymore)
Total deflection limit, L/Value
Value > 0
Total camber limit, L/Value
Value > 0
Pattern live load factor
Value >= 0
Demand/capacity ratio limit
Value > 0
Reliability factor
Value > 0
Max Number of Auto Iterations
Value > 0
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise, it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("SP 16.13330.2017")
'get preference item
   ret = SapModel.DesignSteel.SP16_13330_2017.GetPreference(4, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStSP16_13330_2017 Interface
ETABSv1 Namespace